//#include <stdio.h>  
//
//int main() 
//{   
//    // 赋值运算赋
//     
//    // +=
//    // 把左边右边进行相加，结果复制在左边，对右边没有影响
//    int a = 10;
//    int b = 20;
//    a += b;  // a = a + b
//    printf("%d\n" , a); // 600
//    printf("%d\n", b); // 20
//
//    // -=   *=   /=   %=都一样 
//
//
//
//
//    // 自加自减运算符
//    /*
//       符号                 说明
//        ++               变量的值+1
//        --               变量的值-1
//
//        既可以放前面也可以放后面
//    
//    */
//
//    
//
//    // 关系运算符
//    // ==    ！=    >    >=    <   <=
//
//    // 思考1，判断一个数是否为偶数
//    int aa = 11;
//    printf("%d\n", aa % 2 == 0);     //0
//
//    // 思考2，判断一个数字是否超过100
//    int number = 100;
//    printf("%d\n", number <= 100);   //1
//
//    // 思考3，在支付中判断银行卡余额是否够
//    // 需要支付的前 <= 银行卡余额
//    int pay = 100;
//    int money = 200;
//    printf("%d\n", pay <= money);     //1
//
//    //思考4，电商项目的购买业务，判断货物的库存是否够
//    //  库存 >= 购买商品数量
//    int buy = 10;
//    int ware = 100;
//    printf("%d\n", ware >= buy);    //1
//
//
//    // 逻辑运算赋
//    // &&（而且）    ||（或者）    ！（取反）
//
//    // &&应用案例,都相同才可以
//    printf("%d\n", 1 && 1); //1
//    printf("%d\n", 0 && 1);  //0
//
//    // ||（或）应用案例，一个不相同就成立
//    printf("%d\n", 1 || 1);  //1
//    printf("%d\n", 1 || 0);  //1
//
//    // 取反
//    printf("%d\n", !1);  //0
//    printf("%d\n", !0);  //1
//
//
//
//    // 三元运算符
//    // 格式：关系表达式 ？ 表达式1 ：表达式2
//    
//
//    // 练习1：获取两个变量中的最大值
//    int num1 = 10;
//    int num2 = 20;
//    // 大于号表示哪个数大，小于号表示哪一个数小
//    int num3 = num1 > num2 ? num1 : num2;
//    printf("%d\n", num3);
//    printf("%d\n", num1 < num2 ? num1 : num2);
//
//
//    // 练习2：获取三个变量中最大的值
//    int q = 30;
//    int w = 10;
//    int e = 20;
//
//    // 先求两个数之间的最大值
//    int temp = q > w ? q : w;
//    // 再比较较大值跟第三个数据及逆行比较
//    int max = temp > e ? temp : e;
//    // 输出打印
//    printf("%d\n", max);
//
//     
//
//
//    return 0;      
//}
//
